import React from "react";
import useTranslation from "@/hooks/useTranslation";
import Image from "next/image";
import adImg2 from "@/../../public/assets/Frame 284048.svg"; 
import adImg3 from "@/../../public/assets/Group 284200.png";
import { Box, Text } from "@chakra-ui/react";
const About = () => {
  const { t } = useTranslation();

  return (
    <Box width={"full"} style={{position:"relative", alignItems: "center", justifyContent: "center"}} display={["none","none","flex"]}>
          <Image
            src={adImg2}
            alt="bannerImg"
            style={{
              width: "100%",
            }}
            className="myImage"
          />
            <div style={{width: "50%", position:"absolute",alignItems: "center", justifyContent: "center", display:"flex"}}>
          <Image
            src={adImg3}
            alt="bannerImg"
            className="myImage"
            />
            <Text style={{fontSize: "5vw",
                fontWeight: 400,
                color: "white",
                textAlign: "center",
                position: "absolute",
                zIndex: 99,
                top: "3%"}}
              >
                {t("supplier.about")}
              </Text>
              <Text className="AboutText" style={{fontSize: "1.5vw",
                fontWeight: 300,
                color: "white",
                textAlign: "center",
                position: "absolute",
                zIndex: 99,
                width:"auto",
                WebkitLineClamp:"7",
                WebkitBoxOrient:"vertical",
                overflow:"hidden",
                display: "-webkit-box",
                textOverflow: "ellipsis",
                top: "22%"}}
                p={["10px 10px 0 10px", "20px 20px 0 20px"]}
                // direction="rtl"

              >
                نبذة عن تطبيق سلال سلال تطبيقٌ شامل يتيح لكم الشراء بسهولةٍ من متاجر اللحوم الطازجة والأسماك الطازجة والدواجن الطازجة والخضروات والفواكه الطازجة الى الحلوى العمانية إلى بقية محلات المواد الغذائية الأقرب إليكم في كل أرجاء سلطنة عمان. التطبيق من تطوير شركة أفاق الأمل؛ التي تعمل على توظيف التقنية في تقديم حلولٍ فعّالة للمستخدمين. يضم سلال العديد من الأقسام المختلفة بدايةً من قسم اللحوم والدواجن والأسماك، والخضروات والفواكه، حتى المخابز ووصولًا إلى متاجر البن والتوابل. تحرص الشركة على تطوير التطبيق بشكلٍ دوري؛ ليكون الوجهة الأولى للعملاء في سلطنة عمان وخارجها في المستقبل القريب. سلال نصلك في الحال. سلال تطبيق متخصص في جمع محلات المواد الغذائية بكل أنواعها بسهولةٍ تامة. التطبيق من تطوير شركة أفاق الأمل، والتي يقع مقرها الرئيسي في محافظة مسقط، بولاية العامرات – سلطنة عمان. يوفر التطبيق العديد من المميزات التي تجعله الخيار الأمثل للتسوق من المتاجر عبر الإنترنت. رؤيتنا أن يكون تطبيق سلال هو الخيار الأمثل لكل المستخدمين في سلطنة عمان، وأن يقدم خدماته في القريب في بقية دول مجلس التعاون الخليجي؛ لتكن لنا بصمة في رؤية عمان 2040. رسالتنا إيجاد حلول فعّالة تسهِّل عملية التسوق، وشراء مستلزمات المنزل لكل الأسر والأفراد المقيمين في سلطنة عمان، مع توفير عروض مميزة وجودة عالية. أهدافنا * هدفنا الأول أن نكون من المساهمين في تحقيق رؤية عمان 2040 عبر أفكارنا المبتكرة. * أن يكون سلال أحد المشروعات الرائدة في سلطنة عمان وبقية دول الخليج العربي. * تسهيل عملية الشراء على المستهلك من خلال توفير العديد من الخيارات أمامه. التوسع في نشاط التطبيق ليضيف المزيد من الخدمات التي تلبي حاجة العميل. قيمنا التنوع يضم تطبيق سلال عددًا كبيرًا من المتاجر المتخصصة في مختلف أنواع المواد الغذائية؛ لأن غايتنا أن نوفر على العملاء عناء وجهد البحث. الجودة نراعي معايير الجودة الشاملة بدايةً من قبول المتاجر للانضمام إلى التطبيق، ومرورًا بعملية الشحن؛ ووصولًا إلى توفير أفضل سبل الدفع؛ التي تناسب العملاء. الإلتزام نلتزم بتقديم كامل خدماتنا بجودةٍ عالية، وأن تصل طلبات العملاء في الوقت المحدد بدون تأخير؛ فهدفنا أن نظل خياركم الأول. التطوير تطور الشركة تطبيق سلال بشكلٍ دوري؛ ليصل إلى النموذج الأمثل 
              </Text>
          </div>
        </Box>
  );
};

export default About;
